In [5]:
import numpy as np
import pandas as pd

In [6]:
dict1 = {
    "name" : ["Harry", "Rohan", "Ali"],
    "marks": [10,20,30]
}

In [7]:
print(dict1)

{'name': ['Harry', 'Rohan', 'Ali'], 'marks': [10, 20, 30]}

In [8]:
df = pd.DataFrame(dict1)

In [9]:
df

    name  marks
0  Harry     10
1  Rohan     20
2    Ali     30

In [10]:
# Export to CSV
df.to_csv('file.csv')
# Export without index
df.to_csv('without_index_file.csv', index=False)

In [11]:
# Preview first n rows
df.head(3)

    name  marks
0  Harry     10
1  Rohan     20
2    Ali     30

In [12]:
# Preview last n rows
df.tail(2)

    name  marks
1  Rohan     20
2    Ali     30

In [13]:
# Describe: Provide statistical information
df.describe()

       marks
count    3.0
mean    20.0
std     10.0
min     10.0
25%     15.0
50%     20.0
75%     25.0
max     30.0

# Importing Data from CSV

In [14]:
data = pd.read_csv('./data/winemag-data_first150k.csv')

In [15]:
data

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,variety,winery
0,0,US,This tremendous 100% varietal wine hails from ...,Martha's Vineyard,96,235.0,California,Napa Valley,Napa,Cabernet Sauvignon,Heitz
1,1,Spain,"Ripe aromas of fig, blackberry and cassis are ...",Carodorum Selección Especial Reserva,96,110.0,Northern Spain,Toro,NaN,Tinta de Toro,Bodega Carmen Rodríguez
2,2,US,Mac Watson honors the memory of a wine once ma...,Special Selected Late Harvest,96,90.0,California,Knights Valley,Sonoma,Sauvignon Blanc,Macauley
3,3,US,"This spent 20 months in 30% new French oak, an...",Reserve,96,65.0,Oregon,Willamette Valley,Willamette Valley,Pinot Noir,Ponzi
4,4,France,"This is the top wine from La Bégude, named aft...",La Brûlade,95,66.0,Provence,Bandol,NaN,Provence red blend,Domaine de la Bégude
...,...,...,...,...,...,...,...,...,...,...,...
150925,150925,Italy,Many people feel Fiano represents southern Ita...,NaN,91,20.0,Southern Italy,Fiano di Avellino,NaN,White Blend,Feudi di San Gregorio
150926,150926,France,"Offers an intriguing nose with ginger, lime an...",Cuvée Prestige,91,27.0,Champagne,Champagne,NaN,Champagne Blend,H.Germain
150927,150927,Italy,This classic example comes from a cru vineyard...,Terre di Dora,91,20.0,Southern Italy,Fiano di Avellino,NaN,White Blend,Terredora
150928,150928,France,"A perfect salmon shade, with scents of peaches...",Grand Brut Rosé,90,52.0,Champagne,Champagne,NaN,Champagne Blend,Gosset
150929,150929,Italy,More Pinot Grigios should taste like this. A r...,NaN,90,15.0,Northeastern Italy,Alto Adige,NaN,Pinot Grigio,Alois Lageder

In [16]:
# Print Specific Column
data.country

0             US
1          Spain
2             US
3             US
4         France
           ...
150925     Italy
150926    France
150927     Italy
150928    France
150929     Italy
Name: country, Length: 150930, dtype: object

In [17]:
# Print a Single Value
# Print First Record from the Country Series
data.country[0]

'US'

In [18]:
# Change Index Values
# data.index = ['index_1', 'index_2', 'index_3']

# Series

In [19]:
series = pd.Series(np.random.rand(34))

In [20]:
series

0     0.972093
1     0.801746
2     0.380875
3     0.314824
4     0.867627
5     0.679721
6     0.418134
7     0.795995
8     0.267410
9     0.549310
10    0.230352
11    0.516148
12    0.865158
13    0.072014
14    0.959801
15    0.689563
16    0.287237
17    0.873201
18    0.009376
19    0.719150
20    0.949581
21    0.328767
22    0.358638
23    0.691508
24    0.185584
25    0.114242
26    0.647694
27    0.860393
28    0.448701
29    0.787978
30    0.562451
31    0.164571
32    0.237416
33    0.110610
dtype: float64

In [21]:
type(series)

pandas.core.series.Series

# Data Frame

In [22]:
new_data_frame = pd.DataFrame(np.random.rand(334, 5), index = np.arange(334))
new_data_frame

            0         1         2         3         4
0    0.752748  0.452008  0.757671  0.313522  0.744601
1    0.287482  0.755186  0.850596  0.134046  0.984723
2    0.032123  0.716090  0.889667  0.966225  0.334066
3    0.899539  0.582066  0.982342  0.805052  0.622935
4    0.405076  0.210897  0.095105  0.912971  0.472325
..        ...       ...       ...       ...       ...
329  0.410652  0.119901  0.869266  0.493028  0.079175
330  0.618011  0.950326  0.820200  0.184578  0.307481
331  0.742722  0.544827  0.993524  0.171983  0.612856
332  0.529219  0.803230  0.107228  0.785083  0.717597
333  0.478841  0.777177  0.299203  0.438314  0.504693

[334 rows x 5 columns]

In [23]:
type(new_data_frame)

pandas.core.frame.DataFrame

In [24]:
new_data_frame.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.494663    0.499130    0.508588    0.504506    0.522635
std      0.287703    0.300600    0.288527    0.280116    0.288289
min      0.009310    0.000153    0.000671    0.000076    0.003204
25%      0.228139    0.247338    0.268692    0.269447    0.304991
50%      0.504450    0.484384    0.507969    0.507626    0.522783
75%      0.738052    0.771328    0.767397    0.751957    0.789577
max      0.999224    0.992663    0.993524    0.992134    0.994135

In [25]:
new_data_frame.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [26]:
new_data_frame.head()

          0         1         2         3         4
0  0.752748  0.452008  0.757671  0.313522  0.744601
1  0.287482  0.755186  0.850596  0.134046  0.984723
2  0.032123  0.716090  0.889667  0.966225  0.334066
3  0.899539  0.582066  0.982342  0.805052  0.622935
4  0.405076  0.210897  0.095105  0.912971  0.472325

In [27]:
new_data_frame[0][0] = "Random Name"

C:\Users\UsEr\AppData\Local\Temp\ipykernel_4996\2778953244.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_data_frame[0][0] = "Random Name"
C:\Users\UsEr\AppData\Local\Temp\ipykernel_4996\2778953244.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Random Name' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  new_data_frame[0][0] = "Random Name"

In [28]:
new_data_frame.head()

             0         1         2         3         4
0  Random Name  0.452008  0.757671  0.313522  0.744601
1     0.287482  0.755186  0.850596  0.134046  0.984723
2     0.032123  0.716090  0.889667  0.966225  0.334066
3     0.899539  0.582066  0.982342  0.805052  0.622935
4     0.405076  0.210897  0.095105  0.912971  0.472325

In [29]:
new_data_frame.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
new_data_frame.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [31]:
new_data_frame.columns

RangeIndex(start=0, stop=5, step=1)

In [32]:
new_data_frame.head()

             0         1         2         3         4
0  Random Name  0.452008  0.757671  0.313522  0.744601
1     0.287482  0.755186  0.850596  0.134046  0.984723
2     0.032123  0.716090  0.889667  0.966225  0.334066
3     0.899539  0.582066  0.982342  0.805052  0.622935
4     0.405076  0.210897  0.095105  0.912971  0.472325

In [33]:
new_data_frame.to_numpy()
new_data_frame[0][0] = 0.3
new_data_frame

            0         1         2         3         4
0         0.3  0.452008  0.757671  0.313522  0.744601
1    0.287482  0.755186  0.850596  0.134046  0.984723
2    0.032123  0.716090  0.889667  0.966225  0.334066
3    0.899539  0.582066  0.982342  0.805052  0.622935
4    0.405076  0.210897  0.095105  0.912971  0.472325
..        ...       ...       ...       ...       ...
329  0.410652  0.119901  0.869266  0.493028  0.079175
330  0.618011  0.950326  0.820200  0.184578  0.307481
331  0.742722  0.544827  0.993524  0.171983  0.612856
332  0.529219  0.803230  0.107228  0.785083  0.717597
333  0.478841  0.777177  0.299203  0.438314  0.504693

[334 rows x 5 columns]

In [34]:
new_data_frame.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.287482,0.032123,0.899539,0.405076,0.945061,0.973247,0.519969,0.230845,0.374531,...,0.402262,0.846615,0.972195,0.184786,0.010295,0.410652,0.618011,0.742722,0.529219,0.478841
1,0.452008,0.755186,0.71609,0.582066,0.210897,0.944477,0.172637,0.360513,0.311259,0.044956,...,0.069318,0.606653,0.323591,0.385367,0.674943,0.119901,0.950326,0.544827,0.80323,0.777177
2,0.757671,0.850596,0.889667,0.982342,0.095105,0.272413,0.06627,0.12477,0.581763,0.790291,...,0.922572,0.846665,0.688761,0.967468,0.282039,0.869266,0.8202,0.993524,0.107228,0.299203
3,0.313522,0.134046,0.966225,0.805052,0.912971,0.519146,0.494732,0.488967,0.764727,0.258997,...,0.58156,0.763613,0.272532,0.943183,0.063451,0.493028,0.184578,0.171983,0.785083,0.438314
4,0.744601,0.984723,0.334066,0.622935,0.472325,0.366038,0.319088,0.593273,0.711405,0.994135,...,0.747996,0.299471,0.013437,0.640681,0.198267,0.079175,0.307481,0.612856,0.717597,0.504693

In [35]:

new_data_frame.sort_index(axis=1 , ascending=False)

            4         3         2         1         0
0    0.744601  0.313522  0.757671  0.452008       0.3
1    0.984723  0.134046  0.850596  0.755186  0.287482
2    0.334066  0.966225  0.889667  0.716090  0.032123
3    0.622935  0.805052  0.982342  0.582066  0.899539
4    0.472325  0.912971  0.095105  0.210897  0.405076
..        ...       ...       ...       ...       ...
329  0.079175  0.493028  0.869266  0.119901  0.410652
330  0.307481  0.184578  0.820200  0.950326  0.618011
331  0.612856  0.171983  0.993524  0.544827  0.742722
332  0.717597  0.785083  0.107228  0.803230  0.529219
333  0.504693  0.438314  0.299203  0.777177  0.478841

[334 rows x 5 columns]

# Sorting

Use axis = 0 for Row
Use axis = 1 for Column

In [36]:

new_data_frame.sort_index(axis=1 , ascending=False)

            4         3         2         1         0
0    0.744601  0.313522  0.757671  0.452008       0.3
1    0.984723  0.134046  0.850596  0.755186  0.287482
2    0.334066  0.966225  0.889667  0.716090  0.032123
3    0.622935  0.805052  0.982342  0.582066  0.899539
4    0.472325  0.912971  0.095105  0.210897  0.405076
..        ...       ...       ...       ...       ...
329  0.079175  0.493028  0.869266  0.119901  0.410652
330  0.307481  0.184578  0.820200  0.950326  0.618011
331  0.612856  0.171983  0.993524  0.544827  0.742722
332  0.717597  0.785083  0.107228  0.803230  0.529219
333  0.504693  0.438314  0.299203  0.777177  0.478841

[334 rows x 5 columns]

In [37]:
new_data_frame.head()

          0         1         2         3         4
0       0.3  0.452008  0.757671  0.313522  0.744601
1  0.287482  0.755186  0.850596  0.134046  0.984723
2  0.032123  0.716090  0.889667  0.966225  0.334066
3  0.899539  0.582066  0.982342  0.805052  0.622935
4  0.405076  0.210897  0.095105  0.912971  0.472325

In [38]:
type(new_data_frame[0])

pandas.core.series.Series

In [39]:
newdf2 = new_data_frame
newdf2[0][0]= 934347

In [40]:
new_data_frame

            0         1         2         3         4
0      934347  0.452008  0.757671  0.313522  0.744601
1    0.287482  0.755186  0.850596  0.134046  0.984723
2    0.032123  0.716090  0.889667  0.966225  0.334066
3    0.899539  0.582066  0.982342  0.805052  0.622935
4    0.405076  0.210897  0.095105  0.912971  0.472325
..        ...       ...       ...       ...       ...
329  0.410652  0.119901  0.869266  0.493028  0.079175
330  0.618011  0.950326  0.820200  0.184578  0.307481
331  0.742722  0.544827  0.993524  0.171983  0.612856
332  0.529219  0.803230  0.107228  0.785083  0.717597
333  0.478841  0.777177  0.299203  0.438314  0.504693

[334 rows x 5 columns]

# Copying the DataFrame Right Way

In [41]:
df3 = new_data_frame.copy()
df3.head()

          0         1         2         3         4
0    934347  0.452008  0.757671  0.313522  0.744601
1  0.287482  0.755186  0.850596  0.134046  0.984723
2  0.032123  0.716090  0.889667  0.966225  0.334066
3  0.899539  0.582066  0.982342  0.805052  0.622935
4  0.405076  0.210897  0.095105  0.912971  0.472325

In [43]:
df3[0][0] = 9
new_data_frame.head()

C:\Users\UsEr\AppData\Local\Temp\ipykernel_4996\3125743126.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df3[0][0] = 9
C:\Users\UsEr\AppData\Local\Temp\ipykernel_4996\3125743126.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3[0][0] = 9

          0         1         2         3         4
0    934347  0.452008  0.757671  0.313522  0.744601
1  0.287482  0.755186  0.850596  0.134046  0.984723
2  0.032123  0.716090  0.889667  0.966225  0.334066
3  0.899539  0.582066  0.982342  0.805052  0.622935
4  0.405076  0.210897  0.095105  0.912971  0.472325

In [44]:
df3.head()

          0         1         2         3         4
0         9  0.452008  0.757671  0.313522  0.744601
1  0.287482  0.755186  0.850596  0.134046  0.984723
2  0.032123  0.716090  0.889667  0.966225  0.334066
3  0.899539  0.582066  0.982342  0.805052  0.622935
4  0.405076  0.210897  0.095105  0.912971  0.472325

# Loc

We can access a specific column by row and column. Row and

In [48]:
df3.loc[0,0] = 654
df3.head()

          0         1         2         3         4
0       654  0.452008  0.757671  0.313522  0.744601
1  0.287482  0.755186  0.850596  0.134046  0.984723
2  0.032123  0.716090  0.889667  0.966225  0.334066
3  0.899539  0.582066  0.982342  0.805052  0.622935
4  0.405076  0.210897  0.095105  0.912971  0.472325

## Updating Colmn Label

In [49]:
df3.columns = list("ABCDE")
df3.head()

          A         B         C         D         E
0       654  0.452008  0.757671  0.313522  0.744601
1  0.287482  0.755186  0.850596  0.134046  0.984723
2  0.032123  0.716090  0.889667  0.966225  0.334066
3  0.899539  0.582066  0.982342  0.805052  0.622935
4  0.405076  0.210897  0.095105  0.912971  0.472325

## Accesing unavailable columns creates a new columns

In [51]:
df3.loc[0,0] = 654
df3.head(3)

          A         B         C         D         E  (0, 0)      0
0       654  0.452008  0.757671  0.313522  0.744601     654  654.0
1  0.287482  0.755186  0.850596  0.134046  0.984723     654    NaN
2  0.032123  0.716090  0.889667  0.966225  0.334066     654    NaN

In [53]:
df3.loc[0, 'A'] = 654
df3.head(3)

          A         B         C         D         E  (0, 0)      0
0       654  0.452008  0.757671  0.313522  0.744601     654  654.0
1  0.287482  0.755186  0.850596  0.134046  0.984723     654    NaN
2  0.032123  0.716090  0.889667  0.966225  0.334066     654    NaN

# Drop Column/Row
axis = 1 is equivilent to column
axis = 0 is equivilent to row

In [56]:
df3 = df3.drop((0,0), axis=1)
df3.head()

          A         B         C         D         E      0
0       654  0.452008  0.757671  0.313522  0.744601  654.0
1  0.287482  0.755186  0.850596  0.134046  0.984723    NaN
2  0.032123  0.716090  0.889667  0.966225  0.334066    NaN
3  0.899539  0.582066  0.982342  0.805052  0.622935    NaN
4  0.405076  0.210897  0.095105  0.912971  0.472325    NaN

In [57]:
df3 = df3.drop(0, axis=1)
df3.head()

          A         B         C         D         E
0       654  0.452008  0.757671  0.313522  0.744601
1  0.287482  0.755186  0.850596  0.134046  0.984723
2  0.032123  0.716090  0.889667  0.966225  0.334066
3  0.899539  0.582066  0.982342  0.805052  0.622935
4  0.405076  0.210897  0.095105  0.912971  0.472325

# Accessing Specific Rows & Columns
df3.loc[rows, columns]

In [ ]:
df3.loc[[1,2], ['A', 'E']]